# -------------------------무기 격 스킬----------------------------#
WEAPON_SKILL = {} # 무기 격 스킬 : 데미지, 애니메이션 id, 확률

# 신수둔각도
WEAPON_SKILL[1] = [["dmg", 1000], 154, 5]  # 주작의검
WEAPON_SKILL[2] = [["dmg", 1000], 154, 5]  # 백호의검
WEAPON_SKILL[3] = [["dmg", 1000], 154, 5]  # 현무의검
WEAPON_SKILL[4] = [["dmg", 1000], 154, 5]  # 청룡의검

# 4차 무기
WEAPON_SKILL[6] = [["dmg", 50000], 165, 20]  # 현자금봉
WEAPON_SKILL[7] = [["dmg", 50000], 165, 20]  # 검성기검
WEAPON_SKILL[8] = [["dmg", 50000], 165, 20]  # 진선역봉
WEAPON_SKILL[9] = [["dmg", 50000], 165, 20]  # 태성태도

# 중국무기
WEAPON_SKILL[11] = [["dmg", 1000000], 115, 15]  # 대모홍접선
WEAPON_SKILL[12] = [["dmg", 1000000], 117, 15]  # 구곡검
WEAPON_SKILL[13] = [["dmg", 1000000], 166, 15]  # 영후단봉
WEAPON_SKILL[14] = [["dmg", 1000000], 125, 15]  # 협가검

WEAPON_SKILL[15] = [["dmg", 30000], 125, 30]  # 석단장
WEAPON_SKILL[16] = [["dmg", 60000], 125, 30]  # 백사도
WEAPON_SKILL[17] = [["dmg", 100000], 196, 50]  # 음양도

# 기타 검
WEAPON_SKILL[26] = [["dmg", 5000], 118, 40]  # 녹호박별검
WEAPON_SKILL[112] = [["dmg", 500], 2, 30]  # 양첨목봉
WEAPON_SKILL[114] = [["dmg", 3000], 153, 30]  # 주작의검
WEAPON_SKILL[115] = [["dmg", 5000000], 194, 2]  # 심판의 낫
WEAPON_SKILL[117] = [["dmg", 100000], 120, 15]  # 괴력선창
WEAPON_SKILL[124] = [["buff", 181], 0, 30]  # 얼음검
WEAPON_SKILL[126] = [["dmg", 15000], 154, 15]  # 참마도
WEAPON_SKILL[127] = [["dmg", 60000], 184, 35]  # 청룡신검
WEAPON_SKILL[123] = [["dmg", 120000], 192, 35]  # 현무염도
WEAPON_SKILL[130] = [["dmg", 35000], 126, 20]  # 산적왕의칼

# 일본
WEAPON_SKILL[136] = [["dmg", 20000], 1, 30]  # 이가닌자의검
WEAPON_SKILL[134] = [["dmg", 600000], 170, 30]  # 일화접선
WEAPON_SKILL[135] = [["dmg", 600000], 171, 30]  # 진일신검
WEAPON_SKILL[138] = [["dmg", 600000], 164, 30]  # 청일기창

# 용무기
WEAPON_SKILL[142] = [["dmg", 1000], 123, 10]  # 용마제사검
WEAPON_SKILL[143] = [["dmg", 50000], 123, 10]  # 용마제칠검
WEAPON_SKILL[144] = [["dmg", 1500000], 123, 10]  # 용마제팔검
WEAPON_SKILL[145] = [["dmg", 7000000], 174, 10]  # 용마제구검

WEAPON_SKILL[147] = [["dmg", 1000], 141, 10]  # 용랑제사봉
WEAPON_SKILL[148] = [["dmg", 50000], 141, 10]  # 용랑제칠봉
WEAPON_SKILL[149] = [["dmg", 1500000], 141, 10]  # 용랑제팔봉
WEAPON_SKILL[150] = [["dmg", 7000000], 176, 10]  # 용랑제구봉
# //////////////////////////end///////////////////////////////#


# -------------------------장비 착용시 효과----------------------------#
EQUIP_EFFECTS = {} # 특정 장비 착용시 효과 : [[효과 주기, 효과, 값(%)], [...], ..]
# 장신구
EQUIP_EFFECTS[28] = [[1, "buff", 46], [1, "buff", 47]] # 보무의목걸이
EQUIP_EFFECTS[29] = [[0.5, "buff", 131]] # 투명구두
EQUIP_EFFECTS[72] = [[10, "hp", 2], [10, "sp", 2]] # 해골목걸이
EQUIP_EFFECTS[75] = [[10, "hp", 4], [10, "sp", 4]] # 황금팔찌

# 방패 
EQUIP_EFFECTS[36] = [[10, "sp", 3]] # 기원부
EQUIP_EFFECTS[25] = [[10, "hp", 3]] # 강건부
EQUIP_EFFECTS[33] = [[10, "hp", 2], [10, "sp", 2]] # 도깨비부적
EQUIP_EFFECTS[39] = [[5, "hp", 1.5], [5, "sp", 1.5]] # 정화의방패
EQUIP_EFFECTS[40] = [[5, "hp", 2], [5, "sp", 2]] # 여신의방패
EQUIP_EFFECTS[98] = [[2, "hp", 3], [2, "sp", 3]] # 재생의부적

# 갑옷
EQUIP_EFFECTS[30] = [[1, "buff", 136]] # 가릉빈가의날개옷
EQUIP_EFFECTS[73] = [[1, "buff", 136]] # 가릉빈가의날개옷'진

# 투구
EQUIP_EFFECTS[60] = [[10, "hp", 1], [10, "sp", 1]] # 황금호박투구
EQUIP_EFFECTS[61] = [[10, "sp", 3]] # 연청투구
EQUIP_EFFECTS[62] = [[10, "hp", 3]] # 연홍투구
EQUIP_EFFECTS[74] = [[10, "hp", 4], [10, "sp", 4]] # 황금투구
# //////////////////////////end///////////////////////////////#